// Создайте новый файл проекта. Откройте ваш редактор кода и создайте новый файл с именем `pathOperations.js`.

// Импортируйте модуль `path`. В начале файла импортируйте встроенный модуль `path`.

// Определите базовые переменные. Создайте две переменные: одна для директории, другая для имени файла. Например, директория - `/home/user/documents`, файл - `example.txt`.

// Соедините пути. Используйте метод `join` модуля `path` для объединения директории и имени файла в один полный путь.

// Получите расширение файла. Используйте метод `extname` модуля `path` для получения расширения файла из полного пути.

// Выведите результаты в консоль. Выведите полученный полный путь и расширение файла в консоль.

// Запустите ваш скрипт. В терминале перейдите в директорию с файлом `pathOperations.js` и выполните команду `node pathOperations.js` для запуска скрипта.

const path = require('path')

const home = '/home/user/documents'
const file = 'example.txt'

const fullPath = path.join(home, file)
const fileExt = path.extname(fullPath)

console.log('Full path: ', fullPath);
console.log('File ext: ', fileExt);

